README.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>README</title>
<!-- 2015-03-05 Thu 18:27 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Aris Bezas" />
</head>
<body>
<div id="content">
<h1 class="title">README</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Manual</a></li>
<li><a href="#sec-2">2. Addons Dependencies</a></li>
<li><a href="#sec-3">3. folder content</a></li>
</ul>
</div>
</div>
<p>
Stem Orchestra Performance
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Manual</h2>
<div class="outline-text-2" id="text-1">
<p>
<b>keyboard shorcuts</b>
</p>
<ul class="org-ul">
<li><code>m</code>: to view toolbar
</li>
</ul>


<p>
<b>SuperCollider</b>
</p>
<ul class="org-ul">
<li>Open <code>Stem_.scd</code> file
</li>
</ul>

<p>
<b>OSC Responders</b>
</p>

<ol class="org-ol">
<li><code>OF.projection(0,2)</code>
</li>
<li><code>OF.filter(shaderID)</code>
<ol class="org-ol">
<li>shaderID: 0 -&gt; no shader
</li>
<li>shaderID: 1~9
</li>
</ol>
</li>
<li><code>OF.videoPos(videoID,frameNum)</code>
</li>
<li><code>OF.videoSpeed(videoID,speed)</code>
</li>
</ol>
</div>
</div>


<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Addons Dependencies</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>ofxMtlMapping2D (<a href="https://github.com/morethanlogic/ofxMtlMapping2D">https://github.com/morethanlogic/ofxMtlMapping2D</a>)
</li>
<li>ofxPostGlitch (<a href="https://github.com/maxillacult/ofxPostGlitch">https://github.com/maxillacult/ofxPostGlitch</a>)
</li>
<li>ofxOsc
</li>
<li>ofxXmlSettings
</li>
<li>ofxMSAInteractiveObject
</li>
<li>ofxUI
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> folder content</h2>
<div class="outline-text-2" id="text-3">
<p>
@ /Users/ari/Tools/openframeworks/of<sub>v0</sub>.8.4<sub>osx</sub><sub>release</sub>/apps/myApps/Inside<sub>Outside</sub>:
</p>

<ul class="org-ul">
<li>total used in directory 64 available 139377067
</li>
<li>drwxr-xr-x  12 ari  staff   408 Dec 16 14:25 .
</li>
<li>drwxr-xr-x@ 11 ari  staff   374 Dec 16 14:16 ..
</li>
<li>-rw-r&#x2013;r&#x2013;@  1 ari  staff  6148 Dec 16 14:32 .DS<sub>Store</sub>
</li>
<li>drwxr-xr-x   6 ari  staff   204 Dec 16 14:26 Inside<sub>Outside</sub>.xcodeproj
</li>
<li>-rw-&#x2014;&#x2014;   1 ari  staff   382 Dec 16 14:16 Makefile
</li>
<li>-rw-&#x2014;&#x2014;   1 ari  staff   635 Dec 16 14:16 Project.xcconfig
</li>
<li>drwxr-xr-x   8 ari  staff   272 Aug 28 18:41 SC<sub>Code</sub>
</li>
<li>-rw-r&#x2013;r&#x2013;   1 ari  staff    82 Dec 16 14:16 addons.make
</li>
<li>drwxr-xr-x   5 ari  staff   170 Dec 16 14:26 bin
</li>
<li>-rw-&#x2014;&#x2014;   1 ari  staff  6545 Dec 16 14:16 config.make
</li>
<li>-rw-&#x2014;&#x2014;   1 ari  staff   670 Dec 16 14:16 openFrameworks-Info.plist
</li>
<li>drwxr-xr-x   6 ari  staff   204 Dec 16 14:31 src
</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Aris Bezas</p>
<p class="date">Created: 2015-03-05 Thu 18:27</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.4.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
